In [1]:
import numpy as np
import pandas as pd

# Series

In [2]:
myDict = {"Zeliha":20, "Merthan":29, "Büsra":60}

In [3]:
pd.Series(myDict)

Zeliha     20
Merthan    29
Büsra      60
dtype: int64

In [4]:
benimYaslarim = ["Zeliha", "Merthan", "Büsra","Firdevs"]
benimListem = [50,40,30,10]

In [5]:
pd.Series(benimYaslarim)

0     Zeliha
1    Merthan
2      Büsra
3    Firdevs
dtype: object

In [6]:
pd.Series(benimYaslarim,benimListem)

50     Zeliha
40    Merthan
30      Büsra
10    Firdevs
dtype: object

In [7]:
pd.Series(data = benimYaslarim, index=benimListem )

50     Zeliha
40    Merthan
30      Büsra
10    Firdevs
dtype: object

In [8]:
numpyDizisi = np.array([50,40,30,20])

In [9]:
pd.Series(numpyDizisi)

0    50
1    40
2    30
3    20
dtype: int32

In [10]:
pd.Series(numpyDizisi,benimYaslarim)

Zeliha     50
Merthan    40
Büsra      30
Firdevs    20
dtype: int32

In [11]:
pd.Series(data = [i for i in range(20,60,10)], index =benimYaslarim)

Zeliha     20
Merthan    30
Büsra      40
Firdevs    50
dtype: int64

In [12]:
pd.Series(index = ["Zeliha","Merthan", "Büsra"], data =[2,3,4])

Zeliha     2
Merthan    3
Büsra      4
dtype: int64

In [13]:
pd.Series(["isimler","Zeliha","Merthan", "Büsra"], ["Notlar",40,50,60])

Notlar    isimler
40         Zeliha
50        Merthan
60          Büsra
dtype: object

In [14]:
yarismaSonucu1 = pd.Series([10,20,30,40],[benimYaslarim])

In [15]:
yarismaSonucu1

Zeliha     10
Merthan    20
Büsra      30
Firdevs    40
dtype: int64

In [16]:
 yarismaSonucu2 = pd.Series([80,90,100,95],[benimYaslarim])

In [17]:
yarismaSonucu2

Zeliha      80
Merthan     90
Büsra      100
Firdevs     95
dtype: int64

In [18]:
yarismaSonucu2["Zeliha"]

80

In [19]:
sonSonuc = yarismaSonucu1 + yarismaSonucu2

In [20]:
sonSonuc

Zeliha      90
Merthan    110
Büsra      130
Firdevs    135
dtype: int64

In [21]:
farkliSeries = pd.Series([20,30,40],["a","b","c"])

In [22]:
farkliSeries2 = pd.Series([10,20,50],["a","c","f"])

In [23]:
sonucSeries = farkliSeries + farkliSeries2

In [24]:
sonucSeries

a    30.0
b     NaN
c    60.0
f     NaN
dtype: float64

# DataFrame

In [25]:
import numpy as np
import pandas as pd

In [26]:
data = np.random.randn(3,3) # 3*3'lük random matris

In [27]:
data

array([[ 0.01804187,  0.39127544, -0.53137551],
       [-0.37100382,  1.70232649, -0.03173748],
       [ 0.85944865,  0.26789093, -0.55723867]])

In [28]:
dataFrame = pd.DataFrame(data)

In [29]:
dataFrame

          0         1         2
0  0.018042  0.391275 -0.531376
1 -0.371004  1.702326 -0.031737
2  0.859449  0.267891 -0.557239

In [30]:
type(dataFrame)

pandas.core.frame.DataFrame

In [31]:
dataFrame[1]  #sütun 1'i alır

0    0.391275
1    1.702326
2    0.267891
Name: 1, dtype: float64

In [32]:
dataFrame.loc[1]  #satır 1'i alır

0   -0.371004
1    1.702326
2   -0.031737
Name: 1, dtype: float64

In [33]:
dataFrame.iloc[0]

0    0.018042
1    0.391275
2   -0.531376
Name: 0, dtype: float64

In [34]:
newDataFrame = np.random.randn(4,4)

In [35]:
newDataFrame

array([[-0.3169691 , -1.24582997,  0.71941427, -0.49892288],
       [ 0.80340535, -1.2287983 ,  0.88102549,  0.16977698],
       [ 0.18540308, -1.78461059, -1.61912936,  1.97387922],
       [-0.16914304,  0.37278766, -0.28500272,  0.67295651]])

In [36]:
newDataFrame = pd.DataFrame(newDataFrame,index=["zeliha","merthan","firdevs","büsra"],columns= ["mat","fizik","kimya","genel"])

In [37]:
newDataFrame  # cloumns:kolon eklemek için

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [38]:
newDataFrame["mat"]

zeliha    -0.316969
merthan    0.803405
firdevs    0.185403
büsra     -0.169143
Name: mat, dtype: float64

In [39]:
newDataFrame["kimya"]

zeliha     0.719414
merthan    0.881025
firdevs   -1.619129
büsra     -0.285003
Name: kimya, dtype: float64

In [40]:
newDataFrame[["kimya","fizik"]]

            kimya     fizik
zeliha   0.719414 -1.245830
merthan  0.881025 -1.228798
firdevs -1.619129 -1.784611
büsra   -0.285003  0.372788

In [41]:
newDataFrame.loc["zeliha"]    # sadece satır(row) işlemi için = .loc kullanırız

mat     -0.316969
fizik   -1.245830
kimya    0.719414
genel   -0.498923
Name: zeliha, dtype: float64

In [42]:
newDataFrame.loc["merthan"]  # sadece satırı alırız.    loc için= satırın adı

mat      0.803405
fizik   -1.228798
kimya    0.881025
genel    0.169777
Name: merthan, dtype: float64

In [43]:
newDataFrame.iloc[1]  # index bazlı lokasyon= sadece satırı aldı: indis veriyoruz.

mat      0.803405
fizik   -1.228798
kimya    0.881025
genel    0.169777
Name: merthan, dtype: float64

In [44]:
newDataFrame

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [45]:
newDataFrame["fizik"]

zeliha    -1.245830
merthan   -1.228798
firdevs   -1.784611
büsra      0.372788
Name: fizik, dtype: float64

In [46]:
newDataFrame["yazem"]= newDataFrame["fizik"] + newDataFrame ["fizik"]

In [47]:
newDataFrame    #yeni bir sütun eklemiş olduk

              mat     fizik     kimya     genel     yazem
zeliha  -0.316969 -1.245830  0.719414 -0.498923 -2.491660
merthan  0.803405 -1.228798  0.881025  0.169777 -2.457597
firdevs  0.185403 -1.784611 -1.619129  1.973879 -3.569221
büsra   -0.169143  0.372788 -0.285003  0.672957  0.745575

In [48]:
newDataFrame.drop("yazem", axis = 1)   # drop = fall: kolon gider !! Sütun silmek için her zaman axis=1

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [49]:
newDataFrame.drop("büsra")  # satırı direkt sildi

              mat     fizik     kimya     genel     yazem
zeliha  -0.316969 -1.245830  0.719414 -0.498923 -2.491660
merthan  0.803405 -1.228798  0.881025  0.169777 -2.457597
firdevs  0.185403 -1.784611 -1.619129  1.973879 -3.569221

In [50]:
newDataFrame.drop("büsra", axis= 0)  # yukarıdakiyle aynı işlem satır silindi

              mat     fizik     kimya     genel     yazem
zeliha  -0.316969 -1.245830  0.719414 -0.498923 -2.491660
merthan  0.803405 -1.228798  0.881025  0.169777 -2.457597
firdevs  0.185403 -1.784611 -1.619129  1.973879 -3.569221

In [51]:
newDataFrame

              mat     fizik     kimya     genel     yazem
zeliha  -0.316969 -1.245830  0.719414 -0.498923 -2.491660
merthan  0.803405 -1.228798  0.881025  0.169777 -2.457597
firdevs  0.185403 -1.784611 -1.619129  1.973879 -3.569221
büsra   -0.169143  0.372788 -0.285003  0.672957  0.745575

In [52]:
newDataFrame.drop("yazem", axis= 1, inplace= True)   #kalıcı olarak siler: inplace=True

In [53]:
newDataFrame

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [54]:
newDataFrame.loc["zeliha"]["fizik"]  #ayrı ayrı da yazılabilir

-1.2458299739889276

In [55]:
newDataFrame.loc["zeliha","fizik"]

-1.2458299739889276

In [56]:
newDataFrame

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [57]:
newDataFrame < 0

           mat  fizik  kimya  genel
zeliha    True   True  False   True
merthan  False   True  False  False
firdevs  False   True   True  False
büsra     True  False   True  False

In [58]:
booleanFrame = newDataFrame < 0

In [59]:
booleanFrame

           mat  fizik  kimya  genel
zeliha    True   True  False   True
merthan  False   True  False  False
firdevs  False   True   True  False
büsra     True  False   True  False

In [60]:
newDataFrame[booleanFrame]   #yalnızca 0'dan küçükler yazıldı= True'lar yazılır.

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830       NaN -0.498923
merthan       NaN -1.228798       NaN       NaN
firdevs       NaN -1.784611 -1.619129       NaN
büsra   -0.169143       NaN -0.285003       NaN

In [61]:
newDataFrame[newDataFrame < 0]  #yukarıdaki işlemi tek satırda yapar

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830       NaN -0.498923
merthan       NaN -1.228798       NaN       NaN
firdevs       NaN -1.784611 -1.619129       NaN
büsra   -0.169143       NaN -0.285003       NaN

In [62]:
newDataFrame[newDataFrame["fizik"] > 0]  #büşrayla merthan satırı silinmiş oldu

            mat     fizik     kimya     genel
büsra -0.169143  0.372788 -0.285003  0.672957

In [63]:
newDataFrame[newDataFrame["genel"] > 0] #zeliha,Firdevs,Merthan satırını siler.

              mat     fizik     kimya     genel
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [64]:
newDataFrame

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [65]:
#indeks değiştirmek istersek;

newDataFrame.reset_index()

     index       mat     fizik     kimya     genel
0   zeliha -0.316969 -1.245830  0.719414 -0.498923
1  merthan  0.803405 -1.228798  0.881025  0.169777
2  firdevs  0.185403 -1.784611 -1.619129  1.973879
3    büsra -0.169143  0.372788 -0.285003  0.672957

In [66]:
newDataFrame #tekrar çağırdığımızda eski liste gelir

              mat     fizik     kimya     genel
zeliha  -0.316969 -1.245830  0.719414 -0.498923
merthan  0.803405 -1.228798  0.881025  0.169777
firdevs  0.185403 -1.784611 -1.619129  1.973879
büsra   -0.169143  0.372788 -0.285003  0.672957

In [67]:
yeniIndexList = ["zel", "mer", "büs", "fir"]

In [68]:
newDataFrame["Yeni Index"] = yeniIndexList  #kolon ekledik

In [69]:
newDataFrame["Yeni"] = yeniIndexList  #kolon ekledik
newDataFrame

              mat     fizik     kimya     genel Yeni Index Yeni
zeliha  -0.316969 -1.245830  0.719414 -0.498923        zel  zel
merthan  0.803405 -1.228798  0.881025  0.169777        mer  mer
firdevs  0.185403 -1.784611 -1.619129  1.973879        büs  büs
büsra   -0.169143  0.372788 -0.285003  0.672957        fir  fir

In [70]:
newDataFrame.drop("Yeni", axis =1 ,inplace=True)  #eski kolonu sildik

In [71]:
newDataFrame

              mat     fizik     kimya     genel Yeni Index
zeliha  -0.316969 -1.245830  0.719414 -0.498923        zel
merthan  0.803405 -1.228798  0.881025  0.169777        mer
firdevs  0.185403 -1.784611 -1.619129  1.973879        büs
büsra   -0.169143  0.372788 -0.285003  0.672957        fir

In [72]:
newDataFrame.set_index("Yeni Index", inplace = True)

In [73]:
newDataFrame

                 mat     fizik     kimya     genel
Yeni Index
zel        -0.316969 -1.245830  0.719414 -0.498923
mer         0.803405 -1.228798  0.881025  0.169777
büs         0.185403 -1.784611 -1.619129  1.973879
fir        -0.169143  0.372788 -0.285003  0.672957

In [74]:
newDataFrame.loc["zel"]

mat     -0.316969
fizik   -1.245830
kimya    0.719414
genel   -0.498923
Name: zel, dtype: float64

In [75]:
newDataFrame.iloc[0]

mat     -0.316969
fizik   -1.245830
kimya    0.719414
genel   -0.498923
Name: zel, dtype: float64

# Multi index

In [76]:
ilkIndeksler = ["Simpson", "Simpson" ,"Simpson", "South Park", "South Park", "South Park"]

In [77]:
icIndeksler = ["Homer Simpson", "Bart Simpson", "Marge Simpson" , "Cartman", "Kenny", "Kyle" ]

In [78]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [79]:
birlesmisIndeks

[('Simpson', 'Homer Simpson'),
 ('Simpson', 'Bart Simpson'),
 ('Simpson', 'Marge Simpson'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [80]:
pd.Series(birlesmisIndeks)

0    (Simpson, Homer Simpson)
1     (Simpson, Bart Simpson)
2    (Simpson, Marge Simpson)
3       (South Park, Cartman)
4         (South Park, Kenny)
5          (South Park, Kyle)
dtype: object

In [81]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [82]:
birlesmisIndeks

MultiIndex([(   'Simpson', 'Homer Simpson'),
            (   'Simpson',  'Bart Simpson'),
            (   'Simpson', 'Marge Simpson'),
            ('South Park',       'Cartman'),
            ('South Park',         'Kenny'),
            ('South Park',          'Kyle')],
           )

In [83]:
benimListem = [[40,"a"], [30,"b"],[20,"c"],[10,"d"],[9,"e"],[8,"f"]]

In [84]:
cizgiFilmNumpy = np.array(benimListem)    # Numpy listesine çevirdik.

In [85]:
cizgiDataFrame = pd.DataFrame(cizgiFilmNumpy, index=birlesmisIndeks, columns= ["Yas","Meslek"])

In [86]:
cizgiDataFrame

                         Yas Meslek
Simpson    Homer Simpson  40      a
           Bart Simpson   30      b
           Marge Simpson  20      c
South Park Cartman        10      d
           Kenny           9      e
           Kyle            8      f

In [87]:
cizgiDataFrame.loc["Simpson"]

              Yas Meslek
Homer Simpson  40      a
Bart Simpson   30      b
Marge Simpson  20      c

In [88]:
cizgiDataFrame.iloc[1]

Yas       30
Meslek     b
Name: (Simpson, Bart Simpson), dtype: object

In [89]:
cizgiDataFrame.loc["South Park"].loc["Kenny"]

Yas       9
Meslek    e
Name: Kenny, dtype: object

In [90]:
cizgiDataFrame.index.names = ["Film adı", "İsim"]  #index ismi atadık.

In [91]:
cizgiDataFrame

                         Yas Meslek
Film adı   İsim
Simpson    Homer Simpson  40      a
           Bart Simpson   30      b
           Marge Simpson  20      c
South Park Cartman        10      d
           Kenny           9      e
           Kyle            8      f

# Pandas Operasyonları

In [92]:
import pandas as pd
import numpy as np

data = [[10,20,np.nan],[10,np.nan,15],[20,16,30]]

In [93]:
havaDurumuDataFrame = pd.DataFrame(data,index =["salı","cars","pers"],columns=["ıstanbul","ankara","izmir"])

In [94]:
havaDurumuDataFrame

      ıstanbul  ankara  izmir
salı        10    20.0    NaN
cars        10     NaN   15.0
pers        20    16.0   30.0

In [95]:
havaDurumuDataFrame.dropna()  #non available olan satırlar gitti.

      ıstanbul  ankara  izmir
pers        20    16.0   30.0

In [96]:
havaDurumuDataFrame.dropna(axis=1) #na olan sütunlar gitti

      ıstanbul
salı        10
cars        10
pers        20

In [97]:
havaDurumuDataFrame.dropna(axis=1, inplace= True)

In [98]:
havaDurumuDataFrame

      ıstanbul
salı        10
cars        10
pers        20

In [99]:
sozlukVerisi = pd.DataFrame({"İstanbul":[np.nan,20,30],"izmir":[12,30,65],"İzmit":[30,np.nan,np.nan]},index = ["pazartesi","salı","çarşamba"])

In [100]:
sozlukVerisi

           İstanbul  izmir  İzmit
pazartesi       NaN     12   30.0
salı           20.0     30    NaN
çarşamba       30.0     65    NaN

In [101]:
sozlukVerisi.dropna(axis=1, thresh=2)  #sütunlarda 2 nan olan gider.

           İstanbul  izmir
pazartesi       NaN     12
salı           20.0     30
çarşamba       30.0     65

In [102]:
sozlukVerisi.dropna(axis=1)

           izmir
pazartesi     12
salı          30
çarşamba      65

In [103]:
sozlukVerisi["Konya"] = [20,30,40]

In [104]:
sozlukVerisi

           İstanbul  izmir  İzmit  Konya
pazartesi       NaN     12   30.0     20
salı           20.0     30    NaN     30
çarşamba       30.0     65    NaN     40

In [105]:
sozlukVerisi.fillna(5,inplace=True)        #fillna: boşlukları 5 doldurur.

In [106]:
sozlukVerisi

           İstanbul  izmir  İzmit  Konya
pazartesi       5.0     12   30.0     20
salı           20.0     30    5.0     30
çarşamba       30.0     65    5.0     40

# Groupby

In [107]:
import numpy as np
import pandas as pd

In [108]:
maasSozlugu = {"Departmanlar" : ["Yazılım","Satış","Finans","Pazarlama","İnsan Kaynakları","Hukuk"],
               "Calışan İsmi": ["zeliha","merthan","firdevs","büsra","mine","rasit"],
               "Maas" : [1500,3000,20000,6000,8000,4000]
              }

In [109]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [110]:
maasDataFrame

       Departmanlar Calışan İsmi   Maas
0           Yazılım       zeliha   1500
1             Satış      merthan   3000
2            Finans      firdevs  20000
3         Pazarlama        büsra   6000
4  İnsan Kaynakları         mine   8000
5             Hukuk        rasit   4000

In [111]:
import pandas as pd

YeniMaasSozlugu = {"Departmanlar" : ["Yazılım","Yazılım","Finans","Finans","Hukuk","Hukuk"],
               "Calışan İsmi": ["zeliha","merthan","firdevs","büsra","mine","rasit"],
               "Maas" : [1500,3000,20000,6000,8000,4000]
              }

In [112]:
maasYeniDataFrame = pd.DataFrame(YeniMaasSozlugu)

In [113]:
maasYeniDataFrame

  Departmanlar Calışan İsmi   Maas
0      Yazılım       zeliha   1500
1      Yazılım      merthan   3000
2       Finans      firdevs  20000
3       Finans        büsra   6000
4        Hukuk         mine   8000
5        Hukuk        rasit   4000

In [114]:
grupObjesi = maasYeniDataFrame.groupby("Departmanlar")

In [115]:
grupObjesi.describe() # özellikleri belirtir.(standart sapma-min-max vb.)

              Maas                                                          \
             count     mean          std     min     25%      50%      75%
Departmanlar
Finans         2.0  13000.0  9899.494937  6000.0  9500.0  13000.0  16500.0
Hukuk          2.0   6000.0  2828.427125  4000.0  5000.0   6000.0   7000.0
Yazılım        2.0   2250.0  1060.660172  1500.0  1875.0   2250.0   2625.0


                  max
Departmanlar
Finans        20000.0
Hukuk          8000.0
Yazılım        3000.0

In [116]:
grupObjesi.mean()  # Departmanların ortalama maaşını görürüz.

                 Maas
Departmanlar
Finans        13000.0
Hukuk          6000.0
Yazılım        2250.0

In [117]:
grupObjesi.min()  #Departmanların en düşük maaşını görürüz.

             Calışan İsmi  Maas
Departmanlar
Finans              büsra  6000
Hukuk                mine  4000
Yazılım           merthan  1500

In [118]:
grupObjesi.max() # Departmanların en yüksek maaşını görürüz.

             Calışan İsmi   Maas
Departmanlar
Finans            firdevs  20000
Hukuk               rasit   8000
Yazılım            zeliha   3000

In [119]:
grupObjesi.describe()  #özellikleri belirtir.(standart sapma-min-max vb.)

              Maas                                                          \
             count     mean          std     min     25%      50%      75%
Departmanlar
Finans         2.0  13000.0  9899.494937  6000.0  9500.0  13000.0  16500.0
Hukuk          2.0   6000.0  2828.427125  4000.0  5000.0   6000.0   7000.0
Yazılım        2.0   2250.0  1060.660172  1500.0  1875.0   2250.0   2625.0


                  max
Departmanlar
Finans        20000.0
Hukuk          8000.0
Yazılım        3000.0

# Operasyon Devamı

In [120]:
import numpy as np
import pandas as pd

In [121]:
 sozluk1 = {"isim":["zeliha","merthan","büsra","firdevs"],
            "Spor":["Kosu","yüzme","Kosu","Basketbol"],
           "Kalori": [100,200,300,400]}

In [122]:
sozluk1DataFrame = pd.DataFrame(sozluk1, index = [0,1,2,3])

In [123]:
sozluk1DataFrame

      isim       Spor  Kalori
0   zeliha       Kosu     100
1  merthan      yüzme     200
2    büsra       Kosu     300
3  firdevs  Basketbol     400

In [124]:
sozluk2 = {"isim":["rasit","süheda","fadime","hacer"],
            "Spor":["Kosu","yüzme","Kosu","Basketbol"],
           "Kalori": [150,250,350,400]}

In [125]:
sozluk2DataFrame = pd.DataFrame(sozluk2, index = [4,5,6,7])

In [126]:
sozluk2DataFrame

     isim       Spor  Kalori
4   rasit       Kosu     150
5  süheda      yüzme     250
6  fadime       Kosu     350
7   hacer  Basketbol     400

In [127]:
sozluk3 = {"isim":["halil","mine","elif","emir"],
            "Spor":["Kosu","badminton","Kosu","tenis"],
           "Kalori": [350,450,550,600]}

In [128]:
sozluk3DataFrame = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [129]:
sozluk3DataFrame

     isim       Spor  Kalori
8   halil       Kosu     350
9    mine  badminton     450
10   elif       Kosu     550
11   emir      tenis     600

# Concatenation

In [130]:
pd.concat([sozluk1DataFrame,sozluk2DataFrame,sozluk3DataFrame], axis = 0) #birlestirdik

       isim       Spor  Kalori
0    zeliha       Kosu     100
1   merthan      yüzme     200
2     büsra       Kosu     300
3   firdevs  Basketbol     400
4     rasit       Kosu     150
5    süheda      yüzme     250
6    fadime       Kosu     350
7     hacer  Basketbol     400
8     halil       Kosu     350
9      mine  badminton     450
10     elif       Kosu     550
11     emir      tenis     600

# Merge : birleştirmek

In [131]:
mergeSozluk1 = {"isim":["Zeliha","Merthan","Büsra"],
               "Spor":["Kosu","Basketbol","Yüzme"],
               }

In [132]:
DataFrame1 = pd.DataFrame(mergeSozluk1, index = [0,1,2] )

In [133]:
DataFrame1

      isim       Spor
0   Zeliha       Kosu
1  Merthan  Basketbol
2    Büsra      Yüzme

In [134]:
mergeSozluk2 = {"isim":["Zeliha","Merthan","Büsra"],
               "Kalori":[200,300,400]}

In [135]:
DataFrame2  = pd.DataFrame(mergeSozluk2, index = [0,1,2])

In [136]:
DataFrame2

      isim  Kalori
0   Zeliha     200
1  Merthan     300
2    Büsra     400

In [137]:
pd.merge(DataFrame1,DataFrame2,on = "isim")  #isim bloğu sabit

      isim       Spor  Kalori
0   Zeliha       Kosu     200
1  Merthan  Basketbol     300
2    Büsra      Yüzme     400

In [138]:
import numpy as np
import pandas as pd

In [139]:
maasSozluk = {"İsimler": ["Merthan","Zeliha","Büsra","Firdevs"],
              "Departman": ["Yazılım","Satiş","Pazarlama","Yazılım"],
              "Maas": [100,200,300,400],
             }

In [140]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [141]:
maasDataFrame

   İsimler  Departman  Maas
0  Merthan    Yazılım   100
1   Zeliha      Satiş   200
2    Büsra  Pazarlama   300
3  Firdevs    Yazılım   400

In [142]:
maasDataFrame["Departman"].unique() #özgün verileri:tekleri yazar

array(['Yazılım', 'Satiş', 'Pazarlama'], dtype=object)

In [143]:
maasDataFrame["Departman"].nunique() #number of unique: kaç tane tek var

3

In [144]:
maasDataFrame["Departman"].value_counts() #hangi departmanda kaç kişi var

Yazılım      2
Satiş        1
Pazarlama    1
Name: Departman, dtype: int64

In [145]:
def bruttenNete(maas):
    return maas * 0.66

In [146]:
maasDataFrame["Maas"].apply(bruttenNete)  #değerleri 0.66 ile çarpar

0     66.0
1    132.0
2    198.0
3    264.0
Name: Maas, dtype: float64

In [147]:
maasDataFrame.isnull() # Nan değer var mı ?

   İsimler  Departman   Maas
0    False      False  False
1    False      False  False
2    False      False  False
3    False      False  False

In [148]:
import numpy as np
import pandas as pd

In [149]:
yeniBirVeri = {"Karakter Sınıfı": ["South Park","South Park","Simpson","Simpson","Simpson","Simpson"],
              "Karakter ismi": ["Cartman","Kenny","Homer","Bart","Bart","Bart"],
               "Karakter Yas" : [9,32,56,10,25,50]
              }

In [150]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [151]:
karakterDF

  Karakter Sınıfı Karakter ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            32
2         Simpson         Homer            56
3         Simpson          Bart            10
4         Simpson          Bart            25
5         Simpson          Bart            50

In [152]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter ismi"],aggfunc=np.sum)

#aggfunc belirtmezsek ortalamasını alır

                               Karakter Yas
Karakter Sınıfı Karakter ismi
Simpson         Bart                     85
                Homer                    56
South Park      Cartman                   9
                Kenny                    32

# Excelle calismak

In [153]:
import pandas as pd

In [154]:
dataFrame = pd.DataFrame(pd.read_excel("veri.xlsx"))

In [155]:
dataFrame

  Unnamed: 0  Maas   Yas  Departman
0     Zeliha   100   NaN    Yazılım
1    Merthan   150  56.0    Yazılım
2    Firdevs   200  23.0    Yazılım
3      Büsra   300  12.0  Pazarlama
4      Rasit   160  25.0  Pazarlama
5     Süheda   860  27.0        NaN
6      Halil   135  65.0         İK
7      Hacer   460  50.0      Satis

In [156]:
doluDegerDateFrame = dataFrame.dropna(axis=0) #rowlardan siler

In [157]:
doluDegerDateFrame

  Unnamed: 0  Maas   Yas  Departman
1    Merthan   150  56.0    Yazılım
2    Firdevs   200  23.0    Yazılım
3      Büsra   300  12.0  Pazarlama
4      Rasit   160  25.0  Pazarlama
6      Halil   135  65.0         İK
7      Hacer   460  50.0      Satis

In [158]:
doluDegerDateFrame.to_excel("yeniveri.xlsx") #dolu olan değerleri tekrar excel belgesi yaptık.